## [dev-cp](https://walter.app.spacelift.io/stack/dev-cp/run/01HWP7FZWEPB5CH93M1AG7J3NJ) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HWN3F76333BW0ECVP05KRPCB] Planning changes with 0 custom hooks...
time=2024-04-30T00:47:17Z level=info msg=The stack at /mnt/workspace/source/infra/dev-cp will be processed in the following order for command plan:
Group 1
- Module /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc


aws_vpc.this[0]: Refreshing state... [id=vpc-0d5ec5bc240ca8f07]
aws_default_security_group.this[0]: Refreshing state... [id=sg-018e56f48e3707001]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d02c10f070ae97e6]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-007ef9142c28f7e3e]
aws_subnet.database[2]: Refreshing state... [id=subnet-021642d200dc19721]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0764dcd5747f44216]
aws_route_table.public[0]: Refreshing state... [id=rtb-01647fc407968bf68]
aws_subnet.private[0]: Refreshing state... [id=subnet-0d982b43c4ea69fe1]
aws_subnet.database[0]: Refreshing state... [id=subnet-0041857c020d7a050]
aws_subnet.database[1]: Refreshing state... [id=subnet-012c74976a7e7df32]
aws_subnet.private[1]: Refreshing state... [id=subnet-080204e2e31f60800]
aws_subnet.private[2]: Refreshing state... [id=subnet-0fcb1421ba56d7853]
aws_subnet.public[1]: Refreshing state... [id=subnet-0f90a5a0421692481]
aws_subnet.public[2]: Refreshing state... [id=subnet-03cde3b5a30e87ace]
aws_subnet.public[0]: Refreshing state... [id=subnet-0a5a838fa7519dda7]
aws_route_table.private[1]: Refreshing state... [id=rtb-0b6370a6b5c5e1d4a]
aws_route_table.private[2]: Refreshing state... [id=rtb-0fad955427733b8aa]
aws_route_table.private[0]: Refreshing state... [id=rtb-0c42b5ccea6fed6e5]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01647fc407968bf681080289494]
aws_db_subnet_group.database[0]: Refreshing state... [id=dev-cp-playground]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d57e187f397b12d5]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dec840a9d38b6677]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e5e312d9b2a2273f]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-047164594a4d19631]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01017e284c299e806]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09e359cf31fea139b]
aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-03336417fae358fc2]
aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0f49fc55e86be3313]
aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-08d699bde08b15625]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0a5a838fa7519dda7"
      + tags                               = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
    }

  # aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0f90a5a0421692481"
      + tags                               = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
    }

  # aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-03cde3b5a30e87ace"
      + tags                               = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0c42b5ccea6fed6e5"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0b6370a6b5c5e1d4a"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0fad955427733b8aa"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ nat_ids                                     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ nat_public_ips                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ natgw_ids                                   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ natgw_interface_ids                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ private_nat_gateway_route_ids               = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
time=2024-04-30T00:47:31Z level=info msg=time=2024-04-30T00:47:17Z level=warning msg=Detected that init is needed, but Auto-Init is disabled. Continuing with further actions, but subsequent terraform commands may fail. prefix=[/mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc] 

[01HWN3F76333BW0ECVP05KRPCB] Successfully planned changes
[01HWN3F76333BW0ECVP05KRPCB] Retrieving the dependency graph...
[01HWN3F76333BW0ECVP05KRPCB] Getting path for module us-east-1/playground/vpc
[01HWN3F76333BW0ECVP05KRPCB] Storing original state file for /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic module
[01HWN3F76333BW0ECVP05KRPCB] Uploading the list of managed resources...
[01HWN3F76333BW0ECVP05KRPCB] Retrieving the dependency graph...
[01HWN3F76333BW0ECVP05KRPCB] Getting path for module us-east-1/playground/vpc
[01HWN3F76333BW0ECVP05KRPCB] Analyzing plan for module us-east-1/playground/vpc in directory /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic
[01HWN3F76333BW0ECVP05KRPCB] Uploading the list of managed resources...
[01HWN3F76333BW0ECVP05KRPCB] Please be aware that the run changes calculation includes output changes.
[01HWN3F76333BW0ECVP05KRPCB] Resource list upload is GO
[01HWN3F76333BW0ECVP05KRPCB] Generating JSON representations of the plans...
[01HWN3F76333BW0ECVP05KRPCB] Retrieving the dependency graph...
[01HWN3F76333BW0ECVP05KRPCB] Getting path for module us-east-1/playground/vpc
[01HWN3F76333BW0ECVP05KRPCB] Generating JSON representation of the plan for /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic ...
[01HWN3F76333BW0ECVP05KRPCB] Loading custom plan policy inputs...
[01HWN3F76333BW0ECVP05KRPCB] 0 custom plan policy inputs found
[01HWN3F76333BW0ECVP05KRPCB] No plan policies to evaluate
```

</details>